---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentially
source: html/8f3fcaa2-0376-86ae-234b-5a052fc629b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofMeetsRoofTangentially Property

The roofs cannot be joined because the roof being joined meets the target roof tangentially.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofMeetsRoofTangentially { get; }
```